Table of Contents
 Class ImportContextAware
Namespace
IdeaStatiCa.BimApiLink.Scoping
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class ImportContextAware
Inheritance
object
ImportContextAware
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ImportContextAware()
protected ImportContextAware()
 ImportContextAware(IScopeProvider)
protected ImportContextAware(IScopeProvider scopeProvider)
Parameters
scopeProvider IScopeProvider
Properties
 Scope
protected IScope Scope { get; }
Property Value
IScope
 Edit this page